---
kind: enumMember
id: F:Autodesk.Revit.DB.RoutingPreferenceErrorLevel.Error
enum: Autodesk.Revit.DB.RoutingPreferenceErrorLevel
zh: 错误、报错
source: html/37b1540d-5fe8-7666-b284-4f8d11c14f45.htm
---
# Autodesk.Revit.DB.RoutingPreferenceErrorLevel.Error

**中文**: 错误、报错

Post Revit errors if there is no rule in the routing preference satisfying the current condition.